app/controllers/expressions_controller.rb

SELECT "expressions".* FROM "expressions" ORDER BY "expressions"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def quiz
    @expressions = Expression.all