app/controllers/expressions_controller.rb

  def index
    @expressions = Expression.all

    # generate a number betweem first and last expresion id
    init_num = Expression.first.id
    last_num = Expression.last.id
    generated_expression_id = rand(init_num..last_num)

    @expressionsample = Expression.find(generated_expression_id)
---
SELECT "expressions".* FROM "expressions"
SELECT "expressions".* FROM "expressions" ORDER BY "expressions"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "expressions".* FROM "expressions" WHERE "expressions"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]

  def show
    @expression = Expression.find(params[:id])
---
SELECT "expressions".* FROM "expressions" WHERE "expressions"."id" = $1 LIMIT $2  [["id", 315], ["LIMIT", 1]]