app/controllers/pages_controller.rb

SELECT "expressions".* FROM "expressions" ORDER BY "expressions"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "expressions".* FROM "expressions" ORDER BY "expressions"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "expressions".* FROM "expressions" WHERE "expressions"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT "options".* FROM "options" ORDER BY "options"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "options".* FROM "options" ORDER BY "options"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "options".* FROM "options" WHERE "options"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def quiz
    # generate a number betweem first and last expresion id
    init_num = Expression.first.id
    last_num = Expression.last.id
    generated_expression_id = rand(init_num..last_num)

    # get an expression based on generated id number
    @expression = Expression.find(generated_expression_id)
    @sentence = @expression.sentence
    @definition = @expression.definition

    # generate a number betweem first and last option id
    init_num_option = Option.first.id
    last_num_option = Option.last.id
    generated_option_id = rand(init_num_option..last_num_option)

    # get an option based on generated id number
    @option = Option.find(generated_option_id)